bench/proxysql.log
sysbench 1.0.20 (using system LuaJIT 2.0.5)

Running the test with following options:
Number of threads: 3
Report intermediate results every 5 second(s)
Initializing random number generator from current time

Forcing shutdown in 301 seconds

Initializing worker threads...

Threads started!

[ 5s ] thds: 3 tps: 461.85 qps: 13409.69 (r/w/o: 13409.69/0.00/0.00) lat (ms,95%): 8.43 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 3 tps: 460.82 qps: 13362.35 (r/w/o: 13362.35/0.00/0.00) lat (ms,95%): 8.13 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 3 tps: 416.18 qps: 12059.27 (r/w/o: 12059.27/0.00/0.00) lat (ms,95%): 9.39 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 3 tps: 421.61 qps: 12233.02 (r/w/o: 12233.02/0.00/0.00) lat (ms,95%): 9.06 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 3 tps: 433.40 qps: 12564.67 (r/w/o: 12564.67/0.00/0.00) lat (ms,95%): 8.90 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 3 tps: 415.79 qps: 12058.57 (r/w/o: 12058.57/0.00/0.00) lat (ms,95%): 9.39 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 3 tps: 427.00 qps: 12380.31 (r/w/o: 12380.31/0.00/0.00) lat (ms,95%): 9.22 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 3 tps: 437.17 qps: 12687.23 (r/w/o: 12687.23/0.00/0.00) lat (ms,95%): 9.06 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 3 tps: 411.00 qps: 11916.43 (r/w/o: 11916.43/0.00/0.00) lat (ms,95%): 9.73 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 3 tps: 401.82 qps: 11647.50 (r/w/o: 11647.50/0.00/0.00) lat (ms,95%): 10.09 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 3 tps: 439.40 qps: 12742.87 (r/w/o: 12742.87/0.00/0.00) lat (ms,95%): 8.90 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 3 tps: 439.81 qps: 12759.82 (r/w/o: 12759.82/0.00/0.00) lat (ms,95%): 8.74 err/s: 0.00 reconn/s: 0.00
[ 65s ] thds: 3 tps: 414.99 qps: 12030.84 (r/w/o: 12030.84/0.00/0.00) lat (ms,95%): 9.73 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 3 tps: 435.99 qps: 12644.49 (r/w/o: 12644.49/0.00/0.00) lat (ms,95%): 8.58 err/s: 0.00 reconn/s: 0.00
[ 75s ] thds: 3 tps: 432.00 qps: 12530.53 (r/w/o: 12530.53/0.00/0.00) lat (ms,95%): 9.06 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 3 tps: 399.40 qps: 11579.91 (r/w/o: 11579.91/0.00/0.00) lat (ms,95%): 10.09 err/s: 0.00 reconn/s: 0.00
[ 85s ] thds: 3 tps: 422.60 qps: 12259.46 (r/w/o: 12259.46/0.00/0.00) lat (ms,95%): 9.06 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 3 tps: 412.80 qps: 11972.67 (r/w/o: 11972.67/0.00/0.00) lat (ms,95%): 9.73 err/s: 0.00 reconn/s: 0.00
[ 95s ] thds: 3 tps: 400.00 qps: 11592.08 (r/w/o: 11592.08/0.00/0.00) lat (ms,95%): 10.27 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 3 tps: 427.80 qps: 12405.62 (r/w/o: 12405.62/0.00/0.00) lat (ms,95%): 9.06 err/s: 0.00 reconn/s: 0.00
[ 105s ] thds: 3 tps: 365.80 qps: 10606.82 (r/w/o: 10606.82/0.00/0.00) lat (ms,95%): 11.04 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 3 tps: 420.20 qps: 12190.35 (r/w/o: 12190.35/0.00/0.00) lat (ms,95%): 9.56 err/s: 0.00 reconn/s: 0.00
[ 115s ] thds: 3 tps: 446.81 qps: 12961.78 (r/w/o: 12961.78/0.00/0.00) lat (ms,95%): 8.74 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 3 tps: 418.77 qps: 12137.06 (r/w/o: 12137.06/0.00/0.00) lat (ms,95%): 9.56 err/s: 0.00 reconn/s: 0.00
[ 125s ] thds: 3 tps: 385.01 qps: 11169.83 (r/w/o: 11169.83/0.00/0.00) lat (ms,95%): 10.46 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 3 tps: 391.00 qps: 11340.30 (r/w/o: 11340.30/0.00/0.00) lat (ms,95%): 10.27 err/s: 0.00 reconn/s: 0.00
[ 135s ] thds: 3 tps: 356.59 qps: 10340.94 (r/w/o: 10340.94/0.00/0.00) lat (ms,95%): 10.65 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 3 tps: 374.18 qps: 10849.17 (r/w/o: 10849.17/0.00/0.00) lat (ms,95%): 10.09 err/s: 0.00 reconn/s: 0.00
[ 145s ] thds: 3 tps: 398.20 qps: 11549.86 (r/w/o: 11549.86/0.00/0.00) lat (ms,95%): 9.91 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 3 tps: 402.01 qps: 11660.97 (r/w/o: 11660.97/0.00/0.00) lat (ms,95%): 9.91 err/s: 0.00 reconn/s: 0.00
[ 155s ] thds: 3 tps: 421.61 qps: 12219.57 (r/w/o: 12219.57/0.00/0.00) lat (ms,95%): 9.22 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 3 tps: 408.77 qps: 11850.07 (r/w/o: 11850.07/0.00/0.00) lat (ms,95%): 10.27 err/s: 0.00 reconn/s: 0.00
[ 165s ] thds: 3 tps: 414.46 qps: 12028.65 (r/w/o: 12028.65/0.00/0.00) lat (ms,95%): 9.56 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 3 tps: 429.79 qps: 12464.59 (r/w/o: 12464.59/0.00/0.00) lat (ms,95%): 9.56 err/s: 0.00 reconn/s: 0.00
[ 175s ] thds: 3 tps: 427.55 qps: 12396.39 (r/w/o: 12396.39/0.00/0.00) lat (ms,95%): 9.06 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 3 tps: 427.62 qps: 12403.10 (r/w/o: 12403.10/0.00/0.00) lat (ms,95%): 8.90 err/s: 0.00 reconn/s: 0.00
[ 185s ] thds: 3 tps: 410.04 qps: 11892.65 (r/w/o: 11892.65/0.00/0.00) lat (ms,95%): 9.73 err/s: 0.00 reconn/s: 0.00
[ 190s ] thds: 3 tps: 425.59 qps: 12338.05 (r/w/o: 12338.05/0.00/0.00) lat (ms,95%): 9.06 err/s: 0.00 reconn/s: 0.00
[ 195s ] thds: 3 tps: 428.81 qps: 12435.23 (r/w/o: 12435.23/0.00/0.00) lat (ms,95%): 9.39 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 3 tps: 439.79 qps: 12757.29 (r/w/o: 12757.29/0.00/0.00) lat (ms,95%): 8.43 err/s: 0.00 reconn/s: 0.00
[ 205s ] thds: 3 tps: 431.20 qps: 12496.87 (r/w/o: 12496.87/0.00/0.00) lat (ms,95%): 8.74 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 3 tps: 421.19 qps: 12222.24 (r/w/o: 12222.24/0.00/0.00) lat (ms,95%): 9.22 err/s: 0.00 reconn/s: 0.00
[ 215s ] thds: 3 tps: 422.20 qps: 12236.11 (r/w/o: 12236.11/0.00/0.00) lat (ms,95%): 9.22 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 3 tps: 428.61 qps: 12437.45 (r/w/o: 12437.45/0.00/0.00) lat (ms,95%): 9.22 err/s: 0.00 reconn/s: 0.00
[ 225s ] thds: 3 tps: 399.18 qps: 11566.39 (r/w/o: 11566.39/0.00/0.00) lat (ms,95%): 10.09 err/s: 0.00 reconn/s: 0.00
[ 230s ] thds: 3 tps: 396.61 qps: 11503.37 (r/w/o: 11503.37/0.00/0.00) lat (ms,95%): 9.91 err/s: 0.00 reconn/s: 0.00
[ 235s ] thds: 3 tps: 417.60 qps: 12115.26 (r/w/o: 12115.26/0.00/0.00) lat (ms,95%): 9.56 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 3 tps: 434.20 qps: 12591.26 (r/w/o: 12591.26/0.00/0.00) lat (ms,95%): 8.90 err/s: 0.00 reconn/s: 0.00
[ 245s ] thds: 3 tps: 436.80 qps: 12669.53 (r/w/o: 12669.53/0.00/0.00) lat (ms,95%): 8.43 err/s: 0.00 reconn/s: 0.00
[ 250s ] thds: 3 tps: 439.00 qps: 12732.36 (r/w/o: 12732.36/0.00/0.00) lat (ms,95%): 8.43 err/s: 0.00 reconn/s: 0.00
[ 255s ] thds: 3 tps: 444.41 qps: 12889.01 (r/w/o: 12889.01/0.00/0.00) lat (ms,95%): 8.28 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 3 tps: 416.39 qps: 12066.40 (r/w/o: 12066.40/0.00/0.00) lat (ms,95%): 9.56 err/s: 0.00 reconn/s: 0.00
[ 265s ] thds: 3 tps: 406.39 qps: 11796.98 (r/w/o: 11796.98/0.00/0.00) lat (ms,95%): 9.91 err/s: 0.00 reconn/s: 0.00
[ 270s ] thds: 3 tps: 376.00 qps: 10898.57 (r/w/o: 10898.57/0.00/0.00) lat (ms,95%): 9.91 err/s: 0.00 reconn/s: 0.00
[ 275s ] thds: 3 tps: 386.41 qps: 11207.82 (r/w/o: 11207.82/0.00/0.00) lat (ms,95%): 10.09 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 3 tps: 436.40 qps: 12653.51 (r/w/o: 12653.51/0.00/0.00) lat (ms,95%): 8.74 err/s: 0.00 reconn/s: 0.00
[ 285s ] thds: 3 tps: 416.99 qps: 12090.69 (r/w/o: 12090.69/0.00/0.00) lat (ms,95%): 9.39 err/s: 0.00 reconn/s: 0.00
[ 290s ] thds: 3 tps: 412.56 qps: 11963.68 (r/w/o: 11963.68/0.00/0.00) lat (ms,95%): 9.91 err/s: 0.00 reconn/s: 0.00
[ 295s ] thds: 3 tps: 401.45 qps: 11641.06 (r/w/o: 11641.06/0.00/0.00) lat (ms,95%): 10.65 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 3 tps: 426.21 qps: 12358.40 (r/w/o: 12358.40/0.00/0.00) lat (ms,95%): 8.90 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            3632917
        write:                           0
        other:                           0
        total:                           3632917
    transactions:                        125273 (417.57 per sec.)
    queries:                             3632917 (12109.40 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          300.0065s
    total number of events:              125273

Latency (ms):
         min:                                    4.03
         avg:                                    7.18
         max:                                   43.21
         95th percentile:                        9.56
         sum:                               899786.79

Threads fairness:
    events (avg/stddev):           41757.6667/27.26
    execution time (avg/stddev):   299.9289/0.00